package ByteOperations;

import java.util.Arrays;

/*
    ЗАДАЧА:
    Для каждого числа i от 0 до n нужно вычислить,
    сколько единичных битов (1) содержится в его двоичном представлении.
    Результат сохранить в массив arr, где arr[i] — это количество единиц в числе i.

    ПРИМЕР:
      n = 5
      Бинарные представления чисел:
        0 -> 000 -> 0
        1 -> 001 -> 1
        2 -> 010 -> 1
        3 -> 011 -> 2
        4 -> 100 -> 1
        5 -> 101 -> 2
      Ответ: [0, 1, 1, 2, 1, 2]

    ИДЕЯ РЕШЕНИЯ:
    Используем динамическое программирование и побитовые операции.

    Для любого числа i:
        arr[i] = arr[i >> 1] + (i & 1)

    Объяснение:
      - (i >> 1) — это число i без последнего бита (деление на 2).
      - (i & 1)  — это значение последнего бита (0 или 1).
      - Следовательно, количество единиц в числе i
        равно количеству единиц в числе (i / 2) плюс 1,
        если последний бит равен 1.

    Это даёт простой и эффективный способ вычислить все значения от 0 до n
    за O(n) времени без необходимости отдельно подсчитывать биты для каждого числа.

    СЛОЖНОСТЬ:
      Время:  O(n)
      Память: O(n)
*/

public class Task338 {
    public static void main(String[] args) {


        System.out.println(Arrays.toString(countBits(5)));
    }

    public static int[] countBits(int n) {
        int[] arr = new int[n+1];
        for (int i = 1; i < n+1; i++) {
            arr[i] = arr[i >> 1] + (i & 1);
        }
        return arr;
    }
}
